
<details><summary>Show Format output</summary>

```terraform

main.tf
::error::Terraform exited with code 3.
```

</details>

<details><summary>Show Init output</summary>

```terraform

[0m[1mInitializing HCP Terraform...[0m
[0m[1mInitializing modules...[0m
- app in app
- db in db
- vpc in shared
[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.87.0...
- Installed hashicorp/aws v5.87.0 (signed by HashiCorp)
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mHCP Terraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with HCP Terraform. Try running "terraform plan" to
see any changes that are required for your infrastructure.

If you ever set or change modules or Terraform Settings, run "terraform init"
again to reinitialize your working directory.[0m
```

</details>

<details><summary>Show Validate output</summary>

```terraform

Success! The configuration is valid.
```

</details>

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/postech-fiap-alura/totem-express/runs/run-Kihm52vET1eioWGf

Waiting for the plan to start...

Terraform v1.10.0
on linux_amd64
Initializing plugins and modules...
module.vpc.data.aws_availability_zones.available: Refreshing...
data.aws_availability_zones.available: Refreshing...
module.app.data.aws_availability_zones.available: Refreshing...
module.vpc.aws_vpc.totem_express_vpc: Refreshing state... [id=vpc-0079cee40f51f010f]
module.app.data.aws_iam_role.labrole: Refreshing...
module.app.aws_ecr_repository.repository: Refreshing state... [id=totem_express]
module.app.data.aws_iam_role.labrole: Refresh complete after 0s [id=LabRole]
module.app.data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0d2f272b4d566dc68]
module.vpc.aws_subnet.totem_express_subnets[1]: Refreshing state... [id=subnet-0334b7cc5939ee8c8]
module.vpc.aws_security_group.ssh_cluster: Refreshing state... [id=sg-06f49a6a4b654976b]
module.vpc.aws_subnet.totem_express_subnets[0]: Refreshing state... [id=subnet-08a3f7f439a211c29]
module.db.aws_security_group.db_payments_sg: Refreshing state... [id=sg-0c3f8073ff65e0c95]
module.db.aws_security_group.db_order_product_sg: Refreshing state... [id=sg-096405acb01cd3059]
module.vpc.aws_route_table.public_routetable: Refreshing state... [id=rtb-0e7c088ccf213c5f3]
module.db.aws_db_subnet_group.order_product_subnet_group: Refreshing state... [id=totem-express-produtos-pedidos-subnet-group]
module.db.aws_db_subnet_group.payments_subnet_group: Refreshing state... [id=totem-express-pagamentos-subnet-group]
module.app.aws_eks_cluster.eks-cluster: Refreshing state... [id=totem_express-8soat]
module.vpc.aws_route_table_association.public_rt_association[1]: Refreshing state... [id=rtbassoc-0618352fa60b17b31]
module.vpc.aws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-0b42272434a1b9d1f]
module.app.aws_eks_access_policy_association.eks-policy: Refreshing state... [id=totem_express-8soat#arn:aws:iam::479819428824:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.app.aws_eks_access_entry.access-entry: Refreshing state... [id=totem_express-8soat:arn:aws:iam::479819428824:role/voclabs]
module.app.aws_eks_node_group.node-group: Refreshing state... [id=totem_express-8soat:totem_express-ng]
module.db.aws_db_instance.db-order-product: Refreshing state... [id=db-K3ZY3IVGVXKJK7F6SHD3TFCW74]
module.db.aws_db_instance.db-payments: Refreshing state... [id=db-2OTMEQIW2ENLMAAOAYY7JYDS6E]
module.db.aws_db_instance.db-order-product: Drift detected (update)
module.db.aws_db_instance.db-payments: Drift detected (update)
module.vpc.aws_vpc.totem_express_vpc: Drift detected (update)
module.app.aws_ecr_repository.repository: Drift detected (update)
module.app.aws_eks_access_entry.access-entry: Drift detected (update)
module.app.aws_eks_access_policy_association.eks-policy: Drift detected (update)
module.app.aws_eks_cluster.eks-cluster: Drift detected (update)
module.app.aws_eks_node_group.node-group: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.app.aws_ecr_repository.ecr_order_product_repository will be created
  + resource "aws_ecr_repository" "ecr_order_product_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "totem_express_order_product"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.app.aws_ecr_repository.ecr_payments_repository will be created
  + resource "aws_ecr_repository" "ecr_payments_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "totem_express_payments"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.app.aws_ecr_repository.ecr_users_repository will be created
  + resource "aws_ecr_repository" "ecr_users_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "totem_express_users"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.app.aws_ecr_repository.repository will be destroyed
  - resource "aws_ecr_repository" "repository" {
      - arn                  = "arn:aws:ecr:us-east-1:602275567391:repository/totem_express" -> null
      - id                   = "totem_express" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "totem_express" -> null
      - registry_id          = "602275567391" -> null
      - repository_url       = "602275567391.dkr.ecr.us-east-1.amazonaws.com/totem_express" -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @JoaoHL, Action: `pull_request`*